/*
 *    문자열 관련 데이터형 (자바) ==> "" , char ''
 *    ---------------
 *    String 
 *    ------ 문자열을 저장하는 기능, 문자열 제어하는 기능(라이브러리)
 *     1) 저장방법
 *      *** String s =""; => 가장 많이 사용되는 방법 (기본형처럼 사용) => 웹에 90%(모든 데이터가 문자열)
 *          String s = new String("");
 *     2) String 기능 (메소드)
 *     ---------------
 *        1. 문자 변환
 *           1) toUpperCase : 대문자 변환
 *           2) toLowerCase : 소문자 변환
 *       *** 3) valueOf : 모든 데이터형을 문자열로 변경
 *          
 *        2. 문자 제어
 *        3. 문자 변경
 *        4. 문자 비교
 */
public class 문자열_1 {

}
